# encoding: utf-8

import re

t1 = "四、原告义乌市浪莎小额贷款股份有限公司对被告邓永锋、李海霞共有的坐落于义乌市稠城街道稠州北路955号507、3a07室两处房产拍卖、变卖所得的价款分别在148万元和110万元的最高金额范围内享有优先受偿权"

p1 = re.compile(r'(在)(.*?)万元和(.*?)(万元)')
m = re.search(p1, t1)
res = []
if(m != None):
	print("here")
	res_s1 = m.group(2)
	res_s2 = m.group(3)
	res_i1 = int(res_s1)
	res_i2 = int(res_s2)
	res.append(res_s1)	
	res.append(res_s2)	
	res.append(res_i1)	
	res.append(res_i2)	
	res.append(res_i1+res_i2)

print(res)

t2 = "三、原告义乌市棒杰小额贷款股份有限公司在上述债权及本案诉讼费范围内对被告义乌市白天鹅广告装潢有限公司用于抵押的坐落于义乌市稠州西路53、55、57、5××号的房产[房权证号：义乌房权证稠江字第c00001130号，土地证号：义乌国用（2006）第1-2275号，最高限额：1059万元]享有优先受偿权"
t3 = "三、原告义乌市浪莎小额贷款股份有限公司在上述债权及本案诉讼费用范围内对被告蒋飞龙所有的坐落于东阳市吴宁街道城南西路57巷35号的房产[东房权证吴宁字第××号，东阳市国用（2007）第1-930号]的折价或者拍卖、变卖的价款享有优先受偿权（最高债权数额人民币330万元范围内）"
t4 = "四、由原告永康哈尔斯小额贷款有限公司对被告吕龙英所有的坐落于永康市西溪镇锦绣西溪小区4幢3单元301室的房屋及其土地使用权【房屋所有权证号：永康房权证西溪字第××号，国有土地使用权证号：永国永（2010）第4674号】变价后所得价款在第一、二项款项、案件受理费14640元、诉讼保全费5000元及抵押担保的最高本金限额30万元的范围内优先受偿"

p2 = re.compile(r'(最高限额|最高额|最高抵押金额|最高债权数额|最高本金限额|最高抵押担保金额)(为|人民币|：?)(.*?)(万元)')
m2 = re.search(p2,t4)
res2 = []
if(m2 != None):
	print("--------------------")
	res_s = m2.group(3)
	res_i = int(res_s)
	res2.append(res_i)

print(res2)

t5 = "五、原告义乌市浪莎小额贷款股份有限公司对被告义乌好易日用品有限公司所有的坐落于义乌市苏溪镇的房产（房屋所有权证号：义乌房权证苏溪字第c00162357、c00162358号，国有土地使用权证号：义乌国用（2007）第15-2273号，他项权证号：义乌房他证苏溪字第c13090242号）拍卖、变卖所得的价款在3000万元的最高金额范围内享有优先受偿权；"
t6 = "三、原告义乌三鼎小额贷款股份有限公司在人民币280万元范围内对被告王松、丁娟英提供最高额抵押担保的位于义乌市南门街536号503室的房屋（房权证号为：义乌房权证江东字第b00002302号至b00002303号）在折价或拍卖、变卖时的价款享有优先受偿权"
p3 = re.compile(r'(在人民币|在)(.*?)(万元)[(的)(最高金额)(范围)]')#((的?)(最高金额?))(范围)')
temp_t = t5
if(re.search(p3,temp_t) != None):
	res_str = p3.sub(r'zai\2万元',temp_t)
	print(res_str)
m3 = re.search(p3,temp_t)
res3 = []
if(m3 != None):
	print("---------------------")
	res_s = m3.group(2)
	res_i = int(res_s)
	res3.append(res_i)

print(res3)
